AndreLYL/Intern/PSoC/Mux_ADC07_probe01.cydsn/Generated_Source/PSoC6/WS_DMA.h
__STATIC_INLINE uint32_t WS_DMA_GetInterruptStatus(void);
__STATIC_INLINE void     WS_DMA_ClearInterrupt(void);
__STATIC_INLINE void     WS_DMA_SetInterrupt(void);
__STATIC_INLINE uint32_t WS_DMA_GetInterruptMask(void);
__STATIC_INLINE void     WS_DMA_SetInterruptMask(uint32_t interrupt);
__STATIC_INLINE uint32_t WS_DMA_GetInterruptStatusMasked(void);


/***************************************
*    Global Variables
***************************************/
extern uint8_t WS_DMA_initVar;

extern const cy_stc_dma_descriptor_config_t WS_DMA_Descriptor_1_config;
extern cy_stc_dma_descriptor_t WS_DMA_Descriptor_1;



/***************************************
*    In-line Function Implementation
***************************************/

/*******************************************************************************
* Function Name: WS_DMA_Stop
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Disable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void WS_DMA_Stop(void)
{
    Cy_DMA_Channel_Disable(WS_DMA_HW, WS_DMA_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: WS_DMA_ChannelEnable
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Enable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void WS_DMA_ChannelEnable(void)
{
    Cy_DMA_Channel_Enable(WS_DMA_HW, WS_DMA_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: WS_DMA_ChannelDisable
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Disable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void WS_DMA_ChannelDisable(void)
{
    Cy_DMA_Channel_Disable(WS_DMA_HW, WS_DMA_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: WS_DMA_SetDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void WS_DMA_SetDescriptor(cy_stc_dma_descriptor_t const * descriptor)
{
    Cy_DMA_Channel_SetDescriptor(WS_DMA_HW, WS_DMA_DW_CHANNEL, descriptor);
}


/*******************************************************************************
* Function Name: WS_DMA_GetDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetCurrentDescriptor() PDL driver function.
*******************************************************************************/
__STATIC_INLINE cy_stc_dma_descriptor_t * WS_DMA_GetDescriptor(void)
{
    return(Cy_DMA_Channel_GetCurrentDescriptor(WS_DMA_HW, WS_DMA_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: WS_DMA_SetNextDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_SetNextDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void WS_DMA_SetNextDescriptor(cy_stc_dma_descriptor_t const * descriptor)
{
    Cy_DMA_Descriptor_SetNextDescriptor(Cy_DMA_Channel_GetCurrentDescriptor(WS_DMA_HW, WS_DMA_DW_CHANNEL), descriptor);
}


/*******************************************************************************
* Function Name: WS_DMA_GetNextDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_GetNextDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE cy_stc_dma_descriptor_t * WS_DMA_GetNextDescriptor(void)
{
    return(Cy_DMA_Descriptor_GetNextDescriptor(Cy_DMA_Channel_GetCurrentDescriptor(WS_DMA_HW, WS_DMA_DW_CHANNEL)));
}


/*******************************************************************************
* Function Name: WS_DMA_SetPriority
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetPriority() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void WS_DMA_SetPriority(uint32_t priority)
{
    Cy_DMA_Channel_SetPriority(WS_DMA_HW, WS_DMA_DW_CHANNEL, priority);
}


/*******************************************************************************
* Function Name: WS_DMA_GetPriority
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetPriority() PDL driver function.  
*******************************************************************************/
__STATIC_INLINE uint32_t WS_DMA_GetPriority(void)
{
    return (Cy_DMA_Channel_GetPriority(WS_DMA_HW, WS_DMA_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: WS_DMA_SetSrcAddress
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_SetSrcAddress() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void WS_DMA_SetSrcAddress(cy_stc_dma_descriptor_t * descriptor, void const * srcAddress)
{
    Cy_DMA_Descriptor_SetSrcAddress(descriptor, srcAddress);
}


/*******************************************************************************
* Function Name: WS_DMA_GetSrcAddress
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_GetSrcAddress() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void * WS_DMA_GetSrcAddress(cy_stc_dma_descriptor_t const * descriptor)
{
    return(Cy_DMA_Descriptor_GetSrcAddress(descriptor));
}


