AndreLYL/Intern/PSoC/Mux_ADC07_probe01.cydsn/Generated_Source/PSoC6/WS_DMA.h
/*******************************************************************************
* Function Name: WS_DMA_GetInterruptMask
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetInterruptMask() PDL driver function.
*******************************************************************************/
__STATIC_INLINE uint32_t WS_DMA_GetInterruptMask(void)
{
    return (Cy_DMA_Channel_GetInterruptMask(WS_DMA_HW, WS_DMA_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: WS_DMA_SetInterruptMask
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetInterruptMask() PDL driver function.
*******************************************************************************/
__STATIC_INLINE void WS_DMA_SetInterruptMask(uint32_t interrupt)
{
    Cy_DMA_Channel_SetInterruptMask(WS_DMA_HW, WS_DMA_DW_CHANNEL, interrupt);
}


/*******************************************************************************
* Function Name: WS_DMA_GetInterruptStatusMasked
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetInterruptStatusMasked() PDL driver function.
*******************************************************************************/
__STATIC_INLINE uint32_t WS_DMA_GetInterruptStatusMasked(void)
{
    return (Cy_DMA_Channel_GetInterruptStatusMasked(WS_DMA_HW, WS_DMA_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: WS_DMA_Trigger
****************************************************************************//**
*
* Invokes the Cy_TrigMux_SwTrigger() PDL driver function.
*
* \param cycles
*  The number of "Clk_Peri" cycles during which the trigger remains activated.
*  The valid range of cycles is 1 ... 254.
*  Also there are special values:
*  CY_TRIGGER_INFINITE - trigger remains activated untill user deactivates it by
*  calling this function with CY_TRIGGER_DEACTIVATE parameter.
*  CY_TRIGGER_DEACTIVATE - it is used to deactivate the trigger activated by
*  calling this function with CY_TRIGGER_INFINITE parameter.
*  Note: the DMA is clocked by "Clk_Slow" which can be slower than "Clk_Peri".
* 
* \return A status:
* - CY_TRIGMUX_SUCCESS: The trigger is succesfully activated/deactivated.
* - CY_TRIGMUX_INVALID_STATE: The trigger is already activated/not active.
*
*******************************************************************************/
__STATIC_INLINE cy_en_trigmux_status_t WS_DMA_Trigger(uint32_t cycles)
{
    return (Cy_TrigMux_SwTrigger((uint32_t)WS_DMA_DW__TR_IN, cycles));
}


#if(CY_DMA_BWC)
/* Definitions to support backward compatibility with the component version 1.0, 
*  they are strongly not recommended to use in new designs */

#define WS_DMA_ChEnable                (WS_DMA_ChannelEnable)
#define WS_DMA_ChDisable               (WS_DMA_ChannelDisable)
#define WS_DMA_SetDataElementSize      (WS_DMA_SetDataSize)
#define WS_DMA_GetDataElementSize      (WS_DMA_GetDataSize)
#define WS_DMA_SetXloopNumDataElements (WS_DMA_SetXloopDataCount)
#define WS_DMA_GetXloopNumDataElements (WS_DMA_GetXloopDataCount)
#define WS_DMA_SetYloopNumDataElements (WS_DMA_SetYloopDataCount)
#define WS_DMA_GetYloopNumDataElements (WS_DMA_GetYloopDataCount)
#define WS_DMA_SetInterruptMask()      (WS_DMA_SetInterruptMask(WS_DMA_INTR_MASK))
#define WS_DMA_GetInterruptCause       (WS_DMA_GetStatus)

#define WS_DMA_PREEMTAMBLE             (WS_DMA_PREEMPTABLE)
/*******************************************************************************
* Function Name: WS_DMA_SetSrcDstTransferWidth
****************************************************************************//**
* This is a legacy API function, it is left here just for backward compatibility
*******************************************************************************/
__STATIC_INLINE void WS_DMA_SetSrcDstTransferWidth(cy_stc_dma_descriptor_t * descriptor, uint32_t options)
{
    uint32_t ctlRegVal = descriptor->ctl & ((uint32_t)~(DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Msk | \
            DW_DESCR_STRUCT_DESCR_CTL_DST_TRANSFER_SIZE_Msk));
    
    descriptor->ctl = ctlRegVal |
        ((options << DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Pos) &
        (DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Msk | DW_DESCR_STRUCT_DESCR_CTL_DST_TRANSFER_SIZE_Msk));
}


/*******************************************************************************
* Function Name: DMA_1_GetSrcDstTransferWidth
****************************************************************************//**
* This is a legacy API function, it is left here just for backward compatibility
*******************************************************************************/
__STATIC_INLINE uint32_t WS_DMA_GetSrcDstTransferWidth(cy_stc_dma_descriptor_t const * descriptor)
{
    uint32_t ctlRegVal = descriptor->ctl & (DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Msk |
        DW_DESCR_STRUCT_DESCR_CTL_DST_TRANSFER_SIZE_Msk);
    
    return(ctlRegVal >> DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Pos);
}

#endif /* CY_DMA_BWC */


#if defined(__cplusplus)
}
#endif

#endif/* (WS_DMA_CH_H) */

/* [] END OF FILE */
